0.1.0/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/constant/dynamicMeshDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "constant";
  object      dynamicMeshDict;
}

dynamicFvMesh   solidBodyMotionFvMesh;
motionSolverLibs ( "libfvMotionSolvers.so" );
solidBodyMotionFvMeshCoeffs
{
  cellZone        rotor;
  solidBodyMotionFunction  rotatingMotion;
  rotatingMotionCoeffs
  {
    origin        (0 0 0);
    axis          (0 0 1);
    omega         6.2832; // rad/s
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
