0.1.0/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      controlDict;
}

application     dym-pimple;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         5;
deltaT          1e-3;
writeControl    adjustableRunTime;
writeInterval   0.1;
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.5;

// vim: set ft=foam et sw=2 ts=2 sts=2:
