0.1.0/tutorials/incompressible/dym-pimple/mixer_vessel_ami_2d/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         Euler;
}
gradSchemes
{
  default         Gauss linear;
  grad(p)         Gauss linear;
  grad(U)         Gauss linear 1;
}
divSchemes
{
  default         none;
  div(phi,U)      Gauss linearUpwind grad(U);
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
  interpolate(HbyA) linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
